# TextNoteOptions Constructor (ElementId) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNoteOptions Constructor (ElementId)
TextNoteOptions Class See Also
---
Constructs text options to create text of the given type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public TextNoteOptions(
	ElementId typeId
)
```

Visual Basic
---
```text
Public Sub New ( _
	typeId As ElementId _
)
```

Visual C++
---
```text
public:
TextNoteOptions(
	ElementId^ typeId
)
```

# ### Parameters
typeId
    Type: Autodesk.Revit.DB..::..ElementId Id of a text type that defines the style of a text note.
# Remarks
Except for the TypeId, all other properties of the option class will be populated with their respective default values.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TextNoteOptions Class
TextNoteOptions Overload
Autodesk.Revit.DB Namespace